In [1]:
import numpy as np
import pandas as pd
import re
from sqlalchemy import create_engine

### Store CSV into DataFrame

In [2]:
csv_file = "./Resources/Malaria_deaths_report.xls"
raw_malaria_df = pd.read_csv(csv_file, encoding='latin_1')
raw_malaria_df.head()

,"Annex 3 ? J. Reported malaria deaths, 2010?2018",Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,WHO region\nCountry/area,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018
2,AFRICAN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Algeria,2,1,?,?,?,?,?,?,0,0,1,0,0,0,0,0,0,0,0
4,Angola,"9,510","9,473","14,434","38,598","12,459","13,768","10,220","9,812","9,465","10,530","8,114","6,909","5,736","7,300","5,714","7,832","15,997","13,967","11,814"

In [3]:
csv_file = "./Resources/04-22-2020.csv"
raw_covid_df = pd.read_csv(csv_file)
raw_covid_df.head()

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Combined_Key
0,45001.0,Abbeville,South Carolina,US,2020-04-22 23:30:53,34.223334,-82.461707,22,0,0,22,"Abbeville, South Carolina, US"
1,22001.0,Acadia,Louisiana,US,2020-04-22 23:30:53,30.295065,-92.414197,117,7,0,110,"Acadia, Louisiana, US"
2,51001.0,Accomack,Virginia,US,2020-04-22 23:30:53,37.767072,-75.632346,59,1,0,58,"Accomack, Virginia, US"
3,16001.0,Ada,Idaho,US,2020-04-22 23:30:53,43.452658,-116.241552,622,12,0,610,"Ada, Idaho, US"
4,19001.0,Adair,Iowa,US,2020-04-22 23:30:53,41.330756,-94.471059,1,0,0,1,"Adair, Iowa, US"

### Create new data with select columns

In [4]:
# Select the rows, beginning with the third
# Select the country column, and the most recent year column
# Drop rows with no numerical data
malaria_df = raw_malaria_df.iloc[2:,[0,raw_malaria_df.shape[1]-1]].dropna()

# Provide simple column names; lowercase for PostgreSQL
malaria_df.columns = ['country','deaths']

# Remove traiing integers (that were probably footnote pointers)
regex_digit = re.compile(r'[\d]')
malaria_df.country = malaria_df.country.str.replace(regex_digit,'')

# Remove parenthetical country name extensions
regex_parenthetical_expression = re.compile(r' \(\w+\)')
malaria_df.country = malaria_df.country.str.replace(regex_parenthetical_expression,'')
# That didn't work, so go manual:
malaria_df.country = malaria_df.country.str.replace(' \(Bolivarian Republic of\)','')
malaria_df.country = malaria_df.country.str.replace(' \(Islamic Republic of\)','')
malaria_df.country = malaria_df.country.str.replace(' \(Plurinational State of\)','')

# Simplify some country names
malaria_df.country = malaria_df.country.str.replace("Lao People's Democratic Republic",'Laos')
malaria_df.country = malaria_df.country.str.replace('United Republic of Tanzania','Tanzania')
malaria_df.country = malaria_df.country.str.replace('Viet Name','Vietname')
malaria_df.country[malaria_df.country.str.contains('Ivorie')] = "Cote d'Ivoire"

# Remove unwanted rows
malaria_df.drop( malaria_df[malaria_df.country.str.contains('Region')].index , inplace=True)
non_country_list = ['African','Eastern Mediterranean','European','Mainland','South-East Asia','Total','Western Pacific']
malaria_df.drop( malaria_df[malaria_df.country.isin(non_country_list)].index , inplace=True)

In [12]:
covid_df = pd.pivot_table(raw_covid_df, values=['Lat','Long_','Deaths'], 
                          index='Country_Region', 
                          aggfunc={'Lat':np.mean,'Long_':np.mean,'Deaths':np.sum}).reset_index()
covid_df.rename(columns={'Country_Region':'country', 'Lat':'latitude', 'Long_':'longitude', 'Deaths':'deaths'}, inplace=True)

# Simplify some country names
covid_df.country = covid_df.country.str.replace('Burma','Myanmar')
covid_df.country = covid_df.country.str.replace('Congo (Brazzaville)','Congo')
covid_df.country = covid_df.country.str.replace('Congo (Kinshasa)','Congo')
covid_df.country = covid_df.country.str.replace('Korea, South','Republic of Korea')

### Connect to local database

In [13]:
rds_connection_string = "postgres:@Jeab2020@localhost:5432/death_db"
engine = create_engine(f'postgresql://{rds_connection_string}')
engine

Engine(postgresql://postgres:***@localhost:5432/death_db)

### Check for tables

In [14]:
engine.table_names()

['malaria', 'covid19']

### Use pandas to load Malaria csv converted DataFrame into database

In [15]:
malaria_df.to_sql(name='malaria', con=engine, if_exists='replace', index=False)

### Use pandas to load Covid19 csv converted DataFrame into database

In [16]:
covid_df.to_sql(name='covid19', con=engine, if_exists='replace', index=False)

### Confirm data has been added by querying the malaria table
* NOTE: can also check using pgAdmin

In [17]:
pd.read_sql_query('select * from malaria', con=engine).head()

        country  deaths
0       Algeria       0
1        Angola  11,814
2         Benin   2,138
3      Botswana       9
4  Burkina Faso   4,294

### Confirm data has been added by querying the covid19 table

In [18]:
pd.read_sql_query('select * from covid19', con=engine).head()

       country  deaths  latitude  longitude
0  Afghanistan      40  33.93911  67.709953
1      Albania      27  41.15330  20.168300
2      Algeria     402  28.03390   1.659600
3      Andorra      37  42.50630   1.521800
4       Angola       2 -11.20270  17.873900

In [19]:
pd.read_sql_query('''select c.country, c.latitude, c.longitude, m.deaths malaria, c.deaths covid19
from covid19 as c
join malaria as m on c.country = m.country''', con=engine)

        country   latitude  longitude malaria  covid19
0   Afghanistan  33.939110  67.709953       1       40
1       Algeria  28.033900   1.659600       0      402
2        Angola -11.202700  17.873900  11,814        2
3     Argentina -38.416100 -63.616700       0      152
4       Armenia  40.069100  45.038200       0       24
..          ...        ...        ...     ...      ...
85   Uzbekistan  41.377491  64.585262       0        7
86    Venezuela   6.423800 -66.589700     257       10
87        Yemen  15.552727  48.516388      57        0
88       Zambia -13.133897  27.849332   1,209        3
89     Zimbabwe -19.015438  29.154857     192        4

[90 rows x 5 columns]